In [2]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import numpy as np
import ast 
from scipy import stats
from ast import literal_eval
from sklearn.feature_extraction.text import TfidfVectorizer, CountVectorizer
from sklearn.metrics.pairwise import linear_kernel, cosine_similarity
# from nltk.stem.snowball import SnowballStemmer
# from nltk.stem.wordnet import WordNetLemmatizer
# from nltk.corpus import wordnet
# from surprise import Reader, Dataset, SVD, evaluate

import warnings; warnings.simplefilter('ignore')

In [3]:
pip install numpy --upgrade

Requirement already up-to-date: numpy in c:\users\mailg\anaconda3\lib\site-packages (1.21.5)
Note: you may need to restart the kernel to use updated packages.

In [4]:
apps = pd.read_csv(r'C:\Users\mailg\Documents\ischool\input_data\apps.tsv', delimiter='\t',encoding='utf-8')
user_history = pd.read_csv(r'C:\Users\mailg\Documents\ischool\input_data\user_history.tsv', delimiter='\t',encoding='utf-8')
jobs = pd.read_csv(r'C:\Users\mailg\Documents\ischool\input_data\jobs.tsv', delimiter='\t',encoding='utf-8', error_bad_lines=False)
users = pd.read_csv(r'C:\Users\mailg\Documents\ischool\input_data\users.tsv' ,delimiter='\t',encoding='utf-8')
test_users = pd.read_csv(r'C:\Users\mailg\Documents\ischool\input_data\test_users.tsv', delimiter='\t',encoding='utf-8')

b'Skipping line 122433: expected 11 fields, saw 12\n'
b'Skipping line 602576: expected 11 fields, saw 12\n'
b'Skipping line 990950: expected 11 fields, saw 12\n'

In [5]:
apps.head()

   UserID  WindowID  Split          ApplicationDate   JobID
0      47         1  Train  2012-04-04 15:56:23.537  169528
1      47         1  Train  2012-04-06 01:03:00.003  284009
2      47         1  Train  2012-04-05 02:40:27.753    2121
3      47         1  Train  2012-04-05 02:37:02.673  848187
4      47         1  Train  2012-04-05 22:44:06.653  733748

In [6]:
apps.columns

Index(['UserID', 'WindowID', 'Split', 'ApplicationDate', 'JobID'], dtype='object')

In [7]:
apps.shape

(1603111, 5)

In [9]:
user_history.head()

,UserID,WindowID,Split,Sequence,JobTitle
0,47,1,Train,1,National Space Communication Programs-Special ...
1,47,1,Train,2,Detention Officer
2,47,1,Train,3,"Passenger Screener, TSA"
3,72,1,Train,1,"Lecturer, Department of Anthropology"
4,72,1,Train,2,Student Assistant

In [10]:
user_history.columns

Index(['UserID', 'WindowID', 'Split', 'Sequence', 'JobTitle'], dtype='object')

In [11]:
user_history.shape

(1753901, 5)

In [14]:
jobs.head()

,JobID,WindowID,Title,Description,Requirements,City,State,Country,Zip5,StartDate,EndDate
0,1,1,Security Engineer/Technical Lead,<p>Security Clearance Required:&nbsp; Top Secr...,<p>SKILL SET</p>\r<p>&nbsp;</p>\r<p>Network Se...,Washington,DC,US,20531,2012-03-07 13:17:01.643,2012-04-06 23:59:59
1,4,1,SAP Business Analyst / WM,<strong>NO Corp. to Corp resumes&nbsp;are bein...,<p><b>WHAT YOU NEED: </b></p>\r<p>Four year co...,Charlotte,NC,US,28217,2012-03-21 02:03:44.137,2012-04-20 23:59:59
2,7,1,P/T HUMAN RESOURCES ASSISTANT,<b> <b> P/T HUMAN RESOURCES ASSISTANT</b> <...,Please refer to the Job Description to view th...,Winter Park,FL,US,32792,2012-03-02 16:36:55.447,2012-04-01 23:59:59
3,8,1,Route Delivery Drivers,CITY BEVERAGES Come to work for the best in th...,Please refer to the Job Description to view th...,Orlando,FL,US,NaN,2012-03-03 09:01:10.077,2012-04-02 23:59:59
4,9,1,Housekeeping,I make sure every part of their day is magica...,Please refer to the Job Description to view th...,Orlando,FL,US,NaN,2012-03-03 09:01:11.88,2012-04-02 23:59:59

In [15]:
jobs.columns

Index(['JobID', 'WindowID', 'Title', 'Description', 'Requirements', 'City',
       'State', 'Country', 'Zip5', 'StartDate', 'EndDate'],
      dtype='object')

In [16]:
jobs.shape

(1091923, 11)

In [17]:
users.head()

,UserID,WindowID,Split,City,State,Country,ZipCode,DegreeType,Major,GraduationDate,WorkHistoryCount,TotalYearsExperience,CurrentlyEmployed,ManagedOthers,ManagedHowMany
0,47,1,Train,Paramount,CA,US,90723,High School,NaN,1999-06-01 00:00:00,3,10.0,Yes,No,0
1,72,1,Train,La Mesa,CA,US,91941,Master's,Anthropology,2011-01-01 00:00:00,10,8.0,Yes,No,0
2,80,1,Train,Williamstown,NJ,US,08094,High School,Not Applicable,1985-06-01 00:00:00,5,11.0,Yes,Yes,5
3,98,1,Train,Astoria,NY,US,11105,Master's,Journalism,2007-05-01 00:00:00,3,3.0,Yes,No,0
4,123,1,Train,Baton Rouge,LA,US,70808,Bachelor's,Agricultural Business,2011-05-01 00:00:00,1,9.0,Yes,No,0

In [18]:
users.columns

Index(['UserID', 'WindowID', 'Split', 'City', 'State', 'Country', 'ZipCode',
       'DegreeType', 'Major', 'GraduationDate', 'WorkHistoryCount',
       'TotalYearsExperience', 'CurrentlyEmployed', 'ManagedOthers',
       'ManagedHowMany'],
      dtype='object')

In [19]:
users.shape

(389708, 15)

In [20]:
test_users.head()

   UserID  WindowID
0     767         1
1     769         1
2     861         1
3    1006         1
4    1192         1

In [21]:
test_users.columns

Index(['UserID', 'WindowID'], dtype='object')

In [22]:
test_users.shape

(22838, 2)

In [24]:
#Exploratory Data analysis and Pre-processing
#There are 3 files with attribute `split`. 1. apps 2. user_history 3. users 
#the data attribute indicates whether we can use a data from training or testing so we generate training and testing dataframes.

In [25]:
apps_training = apps.loc[apps['Split'] == 'Train']

In [26]:
apps_training.shape #training data split; 88.422% of total data approximately

(1417514, 5)

In [32]:
apps_training.head(10)

   UserID  WindowID  Split          ApplicationDate    JobID
0      47         1  Train  2012-04-04 15:56:23.537   169528
1      47         1  Train  2012-04-06 01:03:00.003   284009
2      47         1  Train  2012-04-05 02:40:27.753     2121
3      47         1  Train  2012-04-05 02:37:02.673   848187
4      47         1  Train  2012-04-05 22:44:06.653   733748
5      47         1  Train  2012-04-05 02:34:40.223   576958
6      47         1  Train  2012-04-05 22:55:03.583   262470
7      47         1  Train   2012-04-05 02:38:49.52   602298
8      72         1  Train  2012-04-02 22:36:43.033   834662
9      72         1  Train  2012-04-07 15:19:58.187  1020903

In [28]:
apps_testing = apps.loc[apps['Split'] == 'Test']

In [29]:
apps_testing.shape #testing data split; 11.578% of total data approximately

(185597, 5)

In [31]:
apps_testing.head(10)

     UserID  WindowID Split          ApplicationDate    JobID
126     767         1  Test  2012-04-01 14:37:20.023    85377
127     769         1  Test   2012-04-16 22:36:52.48   853328
128     769         1  Test  2012-04-09 18:59:28.193    86106
129     769         1  Test  2012-04-09 18:59:31.127   327571
130     769         1  Test  2012-04-08 21:29:11.993   119161
131     769         1  Test  2012-04-18 23:49:59.033    28124
132     769         1  Test  2012-04-03 00:57:43.033   306734
133     769         1  Test  2012-04-09 18:59:30.493   584241
134     769         1  Test  2012-04-09 18:59:30.167   811935
135     769         1  Test  2012-04-18 23:50:00.633  1032353

In [34]:
user_history_training = user_history.loc[user_history['Split'] =='Train']
user_history_testing = user_history.loc[user_history['Split'] =='Test']
apps_training = apps.loc[apps['Split'] == 'Train']
apps_testing = apps.loc[apps['Split'] == 'Test']
users_training = users.loc[users['Split']=='Train']
users_testing = users.loc[users['Split']=='Test']

In [35]:
user_history_training.shape

(1652513, 5)

In [36]:
user_history_training.head(10)

,UserID,WindowID,Split,Sequence,JobTitle
0,47,1,Train,1,National Space Communication Programs-Special ...
1,47,1,Train,2,Detention Officer
2,47,1,Train,3,"Passenger Screener, TSA"
3,72,1,Train,1,"Lecturer, Department of Anthropology"
4,72,1,Train,2,Student Assistant
5,72,1,Train,3,Elderly Caregiver
6,72,1,Train,4,NaN
7,72,1,Train,5,"Department Assistant, Department"
8,72,1,Train,6,Book Reviews Editorial Assistant
9,72,1,Train,7,Graduate Assistant

In [37]:
user_history_testing.shape

(101388, 5)

In [38]:
user_history_testing.head(10)

     UserID  WindowID Split  Sequence                      JobTitle
144     767         1  Test         1               Claims Adjuster
145     767         1  Test         2  Professional Baseball Player
146     767         1  Test         3  Professional Baseball Player
147     767         1  Test         4  Professional Baseball Player
148     767         1  Test         5  Professional Baseball Player
149     769         1  Test         1           Shoe Fit Specialist
150     769         1  Test         2      WGCI, Programming Intern
151     769         1  Test         3           Hip Hop Director/DJ
152     769         1  Test         4                        Teller
153     769         1  Test         5                  Head Cashier

In [39]:
users_training.shape

(366870, 15)

In [40]:
users_training.head(10)

,UserID,WindowID,Split,City,State,Country,ZipCode,DegreeType,Major,GraduationDate,WorkHistoryCount,TotalYearsExperience,CurrentlyEmployed,ManagedOthers,ManagedHowMany
0,47,1,Train,Paramount,CA,US,90723,High School,NaN,1999-06-01 00:00:00,3,10.0,Yes,No,0
1,72,1,Train,La Mesa,CA,US,91941,Master's,Anthropology,2011-01-01 00:00:00,10,8.0,Yes,No,0
2,80,1,Train,Williamstown,NJ,US,08094,High School,Not Applicable,1985-06-01 00:00:00,5,11.0,Yes,Yes,5
3,98,1,Train,Astoria,NY,US,11105,Master's,Journalism,2007-05-01 00:00:00,3,3.0,Yes,No,0
4,123,1,Train,Baton Rouge,LA,US,70808,Bachelor's,Agricultural Business,2011-05-01 00:00:00,1,9.0,Yes,No,0
5,131,1,Train,Houston,TX,US,77077,Bachelor's,Finance,1998-05-01 00:00:00,3,14.0,NaN,No,0
6,162,1,Train,Long Beach,CA,US,90807,Master's,I/O Psychology,2012-05-01 00:00:00,10,25.0,No,No,0
7,178,1,Train,Greenville,SC,US,29609,High School,Not Applicable,NaN,6,35.0,No,Yes,4
8,203,1,Train,Colchester,VT,US,05446,Master's,Burlington,NaN,4,3.0,Yes,No,0
9,344,1,Train,Newport News,VA,US,23601,High School,Not Applicable,2007-01-01 00:00:00,3,7.0,Yes,No,0

In [41]:
users_testing.shape

(22838, 15)

In [42]:
users_testing.head(10)

,UserID,WindowID,Split,City,State,Country,ZipCode,DegreeType,Major,GraduationDate,WorkHistoryCount,TotalYearsExperience,CurrentlyEmployed,ManagedOthers,ManagedHowMany
31,767,1,Test,Murrieta,CA,US,92562,Bachelor's,University Studies/Business,2008-05-01 00:00:00,5,16.0,No,No,0
32,769,1,Test,Roselle,IL,US,60172,Bachelor's,Radio-Television,2011-05-01 00:00:00,5,5.0,Yes,No,0
33,861,1,Test,Morris,IL,US,60450,High School,General Studies,1989-05-01 00:00:00,7,21.0,NaN,No,0
38,1006,1,Test,West Chester,PA,US,19382,High School,Not Applicable,2008-06-01 00:00:00,3,6.0,Yes,No,0
44,1192,1,Test,Cincinnati,OH,US,45255,Bachelor's,Marketing,NaN,5,6.0,Yes,No,0
70,2003,1,Test,Louisville,KY,US,40258,High School,NaN,NaN,3,5.0,No,No,0
72,2011,1,Test,Jeffersonville,IN,US,47130,High School,HVAC,2006-01-01 00:00:00,1,4.0,No,Yes,30
80,2241,1,Test,Moreno Valley,CA,US,92553,None,Advanced Supervision,2003-01-01 00:00:00,4,8.0,NaN,No,0
82,2272,1,Test,Chicago,IL,US,60617,None,NaN,2012-04-01 00:00:00,2,13.0,Yes,No,0
100,2652,1,Test,Glendale,CA,US,91204,High School,Not Applicable,1987-01-01 00:00:00,3,21.0,No,Yes,3

In [43]:
#Pre-processing 
#Considered only US region for building this.

In [44]:
jobs_US = jobs.loc[jobs['Country']=='US']

In [47]:
#Looking for similar Jobs
jobs_US.columns

Index(['JobID', 'WindowID', 'Title', 'Description', 'Requirements', 'City',
       'State', 'Country', 'Zip5', 'StartDate', 'EndDate'],
      dtype='object')

In [48]:
jobs_US.head().transpose()

,0,1,2,3,4
JobID,1,4,7,8,9
WindowID,1,1,1,1,1
Title,Security Engineer/Technical Lead,SAP Business Analyst / WM,P/T HUMAN RESOURCES ASSISTANT,Route Delivery Drivers,Housekeeping
Description,<p>Security Clearance Required:&nbsp; Top Secr...,<strong>NO Corp. to Corp resumes&nbsp;are bein...,<b> <b> P/T HUMAN RESOURCES ASSISTANT</b> <...,CITY BEVERAGES Come to work for the best in th...,I make sure every part of their day is magica...
Requirements,<p>SKILL SET</p>\r<p>&nbsp;</p>\r<p>Network Se...,<p><b>WHAT YOU NEED: </b></p>\r<p>Four year co...,Please refer to the Job Description to view th...,Please refer to the Job Description to view th...,Please refer to the Job Description to view th...
City,Washington,Charlotte,Winter Park,Orlando,Orlando
State,DC,NC,FL,FL,FL
Country,US,US,US,US,US
Zip5,20531,28217,32792,NaN,NaN
StartDate,2012-03-07 13:17:01.643,2012-03-21 02:03:44.137,2012-03-02 16:36:55.447,2012-03-03 09:01:10.077,2012-03-03 09:01:11.88
EndDate,2012-04-06 23:59:59,2012-04-20 23:59:59,2012-04-01 23:59:59,2012-04-02 23:59:59,2012-04-02 23:59:59

In [49]:
jobs_US_base_line = jobs_US.iloc[0:10000,0:8]

In [50]:
jobs_US_base_line.head()

,JobID,WindowID,Title,Description,Requirements,City,State,Country
0,1,1,Security Engineer/Technical Lead,<p>Security Clearance Required:&nbsp; Top Secr...,<p>SKILL SET</p>\r<p>&nbsp;</p>\r<p>Network Se...,Washington,DC,US
1,4,1,SAP Business Analyst / WM,<strong>NO Corp. to Corp resumes&nbsp;are bein...,<p><b>WHAT YOU NEED: </b></p>\r<p>Four year co...,Charlotte,NC,US
2,7,1,P/T HUMAN RESOURCES ASSISTANT,<b> <b> P/T HUMAN RESOURCES ASSISTANT</b> <...,Please refer to the Job Description to view th...,Winter Park,FL,US
3,8,1,Route Delivery Drivers,CITY BEVERAGES Come to work for the best in th...,Please refer to the Job Description to view th...,Orlando,FL,US
4,9,1,Housekeeping,I make sure every part of their day is magica...,Please refer to the Job Description to view th...,Orlando,FL,US

In [54]:
jobs_US_base_line['Title'] = jobs_US_base_line['Title'].fillna('')
jobs_US_base_line['Description'] = jobs_US_base_line['Description'].fillna('')
jobs_US_base_line['Requirements'] = jobs_US_base_line['Requirements'].fillna('')

jobs_US_base_line['Description'] = jobs_US_base_line['Title'] + jobs_US_base_line['Description']

In [55]:
tf = TfidfVectorizer(analyzer='word',ngram_range=(1, 2),min_df=0, stop_words='english')
tfidf_matrix = tf.fit_transform(jobs_US_base_line['Description'])

In [56]:
tfidf_matrix.shape

(10000, 531046)

In [57]:
# http://scikit-learn.org/stable/modules/metrics.html#linear-kernel
cosine_sim = linear_kernel(tfidf_matrix, tfidf_matrix)

In [58]:
cosine_sim[0]

array([1.        , 0.04327048, 0.00727757, ..., 0.03766308, 0.03766308,
       0.03766308])

In [59]:
jobs_US_base_line = jobs_US_base_line.reset_index()
titles = jobs_US_base_line['Title']
indices = pd.Series(jobs_US_base_line.index, index=jobs_US_base_line['Title'])
#indices.head(2)

In [60]:
def get_recommendations(title):
    idx = indices[title]
    #print (idx)
    sim_scores = list(enumerate(cosine_sim[idx]))
    #print (sim_scores)
    sim_scores = sorted(sim_scores, key=lambda x: x[1], reverse=True)
    job_indices = [i[0] for i in sim_scores]
    return titles.iloc[job_indices]

In [65]:
get_recommendations('SAP Business Analyst / WM').head(10)

1                           SAP Business Analyst / WM
6051                    SAP FI/CO Business Consultant
5868                       SAP FI/CO Business Analyst
5159                          SAP Basis Administrator
5351    SAP Sales and Distribution Solution Architect
4796       Senior Specialist - SAP Configuration - SD
5117                       SAP Integration Specialist
5409            Senior Business Systems Analyst - SAP
5244                                 Business Analyst
4818                   Business Analyst, Corporate IT
Name: Title, dtype: object

In [66]:
get_recommendations('Security Engineer/Technical Lead').head(10)

0              Security Engineer/Technical Lead
5906                   Senior Security Engineer
3771                     Director of Admissions
6293    3 Network Architects needed - immediate
3557                          Assistant Manager
401          National Sales & Marketing Manager
2606               Inventory Analyst/ Scheduler
3757                        CLINICAL PHARMACIST
3478           Customer Service Representatives
1302             Information Security Architect
Name: Title, dtype: object

In [67]:
get_recommendations('Immediate Opening').head(10)

13                            Immediate Opening
216                       Accounting/Bookkeeper
2872     Cable TV/Internet/Telephone Installers
4028                               Electricians
4029                               Electricians
4030                               Electricians
8423                                     no job
620                                      DENTAL
5658    Accounts Receivable - Cash Applications
125                                    Optician
Name: Title, dtype: object

In [69]:
get_recommendations('EXPERIENCED ROOFERS').head(10)

26                                    EXPERIENCED ROOFERS
7949    Commercial Roofers  EXPERIENCED in  Hot Asphal...
51                                                 Driver
8012                                       OFFICE MANAGER
53                                                DRIVERS
44                                   SALES REPRESENTATIVE
59                                        SECURITY GUARDS
45                                             AUTO SALES
30                               Automotive Retail Dealer
60                                     Associate Attorney
Name: Title, dtype: object

In [70]:
#Our Approach
# Finding out similar users, check for jobs they have applied, suggest the same job to other user with similar profiles. 
# using 10 similar users to find out jobs that they have applied. Take a union of the jobs and recommend it to the user base.

In [71]:
user_based_approach_US = users_training.loc[users_training['Country']=='US']

In [72]:
user_based_approach = user_based_approach_US.iloc[0:10000,:]

In [74]:
user_based_approach.head(10)

,UserID,WindowID,Split,City,State,Country,ZipCode,DegreeType,Major,GraduationDate,WorkHistoryCount,TotalYearsExperience,CurrentlyEmployed,ManagedOthers,ManagedHowMany
0,47,1,Train,Paramount,CA,US,90723,High School,NaN,1999-06-01 00:00:00,3,10.0,Yes,No,0
1,72,1,Train,La Mesa,CA,US,91941,Master's,Anthropology,2011-01-01 00:00:00,10,8.0,Yes,No,0
2,80,1,Train,Williamstown,NJ,US,08094,High School,Not Applicable,1985-06-01 00:00:00,5,11.0,Yes,Yes,5
3,98,1,Train,Astoria,NY,US,11105,Master's,Journalism,2007-05-01 00:00:00,3,3.0,Yes,No,0
4,123,1,Train,Baton Rouge,LA,US,70808,Bachelor's,Agricultural Business,2011-05-01 00:00:00,1,9.0,Yes,No,0
5,131,1,Train,Houston,TX,US,77077,Bachelor's,Finance,1998-05-01 00:00:00,3,14.0,NaN,No,0
6,162,1,Train,Long Beach,CA,US,90807,Master's,I/O Psychology,2012-05-01 00:00:00,10,25.0,No,No,0
7,178,1,Train,Greenville,SC,US,29609,High School,Not Applicable,NaN,6,35.0,No,Yes,4
8,203,1,Train,Colchester,VT,US,05446,Master's,Burlington,NaN,4,3.0,Yes,No,0
9,344,1,Train,Newport News,VA,US,23601,High School,Not Applicable,2007-01-01 00:00:00,3,7.0,Yes,No,0

In [77]:
user_based_approach['DegreeType'] = user_based_approach['DegreeType'].fillna('')
user_based_approach['Major'] = user_based_approach['Major'].fillna('')
user_based_approach['TotalYearsExperience'] = str(user_based_approach['TotalYearsExperience'].fillna(''))
user_based_approach['DegreeType'] = user_based_approach['DegreeType'] + user_based_approach['Major'] + user_based_approach['TotalYearsExperience']

In [78]:
tf = TfidfVectorizer(analyzer='word',ngram_range=(1, 2),min_df=0, stop_words='english')
tfidf_matrix = tf.fit_transform(user_based_approach['DegreeType'])

In [79]:
tfidf_matrix.shape

(10000, 10596)

In [80]:
# http://scikit-learn.org/stable/modules/metrics.html#linear-kernel
cosine_sim = linear_kernel(tfidf_matrix, tfidf_matrix)

In [81]:
cosine_sim[0]

array([1.        , 0.80927666, 0.91221395, ..., 0.45692833, 0.89817181,
       0.82444918])

In [82]:
user_based_approach = user_based_approach.reset_index()
userid = user_based_approach['UserID']
indices = pd.Series(user_based_approach.index, index=user_based_approach['UserID'])
#indices.head(2)

In [83]:
def get_recommendations_userwise(userid): # function to get recommendations based on user job history
    idx = indices[userid]
    #print (idx)
    sim_scores = list(enumerate(cosine_sim[idx]))
    #print (sim_scores)
    sim_scores = sorted(sim_scores, key=lambda x: x[1], reverse=True)
    user_indices = [i[0] for i in sim_scores]
    #print (user_indices)
    return user_indices[0:11]

In [84]:
print ("10 Similar users with userId: 123")
get_recommendations_userwise(123)

10 Similar users with userId: 123

[4, 150, 2464, 2846, 7945, 8125, 4570, 9721, 2266, 7818, 1926]

In [85]:
def get_job_id(usrid_list):
    jobs_userwise = apps_training['UserID'].isin(usrid_list) #
    df1 = pd.DataFrame(data = apps_training[jobs_userwise], columns=['JobID'])
    joblist = df1['JobID'].tolist()
    Job_list = jobs['JobID'].isin(joblist) #[1083186, 516837, 507614, 754917, 686406, 1058896, 335132])
    df_temp = pd.DataFrame(data = jobs[Job_list], columns=['JobID','Title','Description','City','State'])
    return df_temp

In [86]:
get_job_id(get_recommendations_userwise(123))

,JobID,Title,Description,City,State
921575,579517,Excellent B2B Sales Opportunity Base+Comm+Bnft...,"<p align=""center"" style=""text-align: center""><...",Atlanta,GA

In [87]:
print ("10 Similar users with userId: 47")
get_recommendations_userwise(47)

10 Similar users with userId: 47

[0, 79, 126, 182, 345, 366, 393, 423, 434, 490, 544]

In [88]:
get_job_id(get_recommendations_userwise(47))

,JobID,Title,Description,City,State
905894,428902,Aircraft Servicer,<b>Job Classification: </b> Direct Hire \r\n\r...,Memphis,TN
975525,1098447,Automotive Service Advisor,<div>\r<div>Briggs Nissan in Lawrence Kansas h...,Lawrence,KS
980507,37309,Medical Lab Technician - High Volume Lab,<span>Position Title:<span>&nbsp;&nbsp;&nbsp;&...,Fort Myers,FL
986244,83507,Nurse Tech (CNA/STNA),"<p align=""center""><b>Purpose of Your Job Posit...",Englewood,FL
987452,93883,Nurse Tech II (CNA/STNA),<B>Nurse Tech II (CNA/STNA)</B> <BR>\r<BR>\rTh...,Fort Myers,FL
1000910,228284,REGISTERED NURSE ICU,"<p><strong><span><font face="""">Registered Nurs...",Punta Gorda,FL
1007140,284840,Certified Nursing Assistant / CNA,"<hr>\r<p style=""text-align: center""><strong>Ce...",Saint Petersburg,FL
1007141,284841,Home Health Aide / HHA,"<hr>\r<p style=""text-align: center""><strong>Ho...",Saint Petersburg,FL
1009455,312536,Secretary II,<br><br><b>Department: </b>COMM Maryland Cardi...,Baltimore,MD
1011978,341662,Medical Assistant,Certified Medical Assistant for busy Pain Clin...,Fort Myers,FL
1034578,551375,Phlebotomist,<p>Every day All Medical Personnel helps excep...,Clearwater,FL
1048060,684278,Sales Representative / Customer Service / Acco...,<P>Central Payment offers limitless opportunit...,Bonita Springs,FL
1066952,867194,Hospital Liaison and Pharmaceutical,Hospital Liaison with Pharmaceutical exp<br />...,Fort Myers,FL
1070785,910932,Nursing: CNA (PRN),<p>&nbsp;</p>\r<p>Take advantage of this great...,Fort Myers,FL
1076051,960285,All college grads apply! Entry level sales and...,<div> <span>\r<div>\r<div><strong>All college ...,Fort Myers,FL
1091311,1108709,Certified Nursing Assistant / CNA / HHA,"<hr>\r<p style=""text-align: center""><strong>Ce...",Sarasota,FL